// ignore_for_file: non_constant_identifier_names

import 'dart:core';
// Map<String,double?> prefixvalue={
//  'متر فراشي':0,
//  'متر جوان ش' :0,
//  'متر جوان ب' :0,
//  'متر فيبر' :0,
//  'متر بلور' :0,
//  'متر منخل' :0,
//  'دولاب منخل' :0,
//  'دولاب عادي' :0,
//  'براغي' :0,
//  'مسكة' :0,
//  'قفل' :0,
//  'ألمنيوم ك1' :0,
//  'ضفدعة' :0,
//  'مفصلة ص' :0,
//  'مفصلة ك' :0,
// };
List<String> prefixName=[
 'متر فراشي',
 'متر جوان ش' ,
 'متر جوان ب' ,
 'متر فيبر' ,
 'متر بلور' ,
 'متر منخل' ,
 'دولاب منخل' ,
 'دولاب عادي' ,
 'براغي' ,
 'مسكة' ,
 'قفل' ,
 'ضفدعة' ,
 'مفصلة ص' ,
 'مفصلة ك' ,
];

List<String> operationName=[
  'عرض حاجب',
   'خصم مسكة ',
  'خصم كعب',
  'خصم منخل طول',
  'خصم منخل عرض',
   'خصم درفة باب طول',
   'خصم درفة باب عرض',
   'خصم كعب باب ',
   'خصم طاقة عرض',
   'خصم طاقة طول',
];
// Map<String,double?> operation={
//  'عرض حاجب': 3.5 ,
//    'خصم مسكة ':4 ,
//   'خصم كعب':20.4 ,
//   'خصم منخل طول':4 ,
//   'خصم منخل عرض':1.8 ,
//    'خصم درفة باب طول':2.5 ,
//    'خصم درفة باب عرض':3.6 ,
//    'خصم كعب باب ':10.5 ,
//    ' خصم طاقة عرض':3.5 ,
//    'خصم طاقة طول':3.5,

//   };
 
   
    

    

 

  
